
public class ConstraintTest17 {

	
//	dept테이블의 구조를 파악해서
//	   loc를 제외한 모든 컬럼에 not null을 적용하시오
//	   
//	   not null적용 후 
//	   입력문을 통해 not null 메시지가 뜨는 경우와
//	   입력이 잘 되는 경우 2가지를 증명하시오
//	   
//	   제약조건을 자신이 만든 테이블에 적용되었는지 확인하시오
//	   
//	   부서테이블에서 LOC컬럼에만
//	   UNIQUE와 널 값을 허용하지 않는 제약조건을 적용하고
//	   수행이 되는 경우와 수행이 안 되는 경우를 작성하고
//	   제약조건이 적용되었는지 확인하시오
	
//  기본키를 잘 적용하시오
//  DEPT테이블에서 DEPTNO컬럼에 기본키를 적용하시오
//  
//  나머지 컬럼들이 기본적으로 존재하고
//  마지막에 컬럼명을 부서의 일련번호라는 컬럼을 만들고
//  제약조건은 유니크 낫 널을 적용한다
//  
//  입력이 가능한 경우와 불가능한 경우의 데이터를 입력하는데
//  기본키와 유니크 낫 널이 차이를 살펴보시오
	
	
	
}
