
public class DbTest1 {

//	1.
//	   테이블 employee라는 테이블을 만드시오
//	   
//	   ename 글자수10
//	   job 글자수 9
//	   sal 숫자 무제한
//	   
//	   2.
//	   employee테이블에 
//	   comm이라는 컬럼을 추가하시오 숫자 4자리
//	   
//	   3.
//	   사원 테이블에
//	   본인명 원하는직업 연봉 커미션 을 입력하시오
//	   친구 한명의 정보도 위와 같이 입력하시오
//	   단, 직업과 comm은 입력하지 않는다
//	   
//	   4.
//	   사원 테이블에 급여 컬럼을 삭제하시오
	
//	1. 사원의 연봉을 구하시오
//	(사원의 급여는 월급니다)
//	
//	사원명	월급		연봉
//	
//	2. 선수들의 키에서 몸무게를 뺀 값을 구하시오
//	
//	이름		키-몸무게
	
	
//	1. 사원의 연봉을 구하시오(사원의 급여는 월급니다)
//	
//	사원명	월급		연봉		연봉+인센티브
//	
//	2. BMI 비만지수를 구하시오
//	
//	선수명	BMI 비만지수
	
//	1.다음과같은 선수들의 출력 형태를 만드시오
//	선수명         키 cm   몸무게 kg
//	박지성 선수, 176 cm, 70 kg
//
//	2. 사원들의 자기소개서 작성
//	자기소개
//	나의 이름은 ??? 입니다 입사한 날은 ???이고 직업은 ??? 인데요
//			앞으로 잘 부탁드립니다
	
//	WHERE
//	1.급여가 1500 이하인 사원을 출력하시오
//	사원번호		사원명	급여
//	
//	2.축구선수 포지션이 골키퍼인 선수들만 출력하시오
//	선수명		포지션		백넘버(등번호)		키
//	
//	3.사원 중 이름이 SMITH인 사원의 모든 정보를 출력하시오
//	
//	4.선수 테이블에서키가 170 센티미터 이상인 사람을 찾으시오
	
	
//	1.사원의 급여가 2000에서 3000사이의 급여를 받는 사원을 조회하시오
//	
//	사원번호		사원명		급여
//	
//	2.급여가 2000미만이거나 3000 이상인 사원을 검색하시오
//	사원번호		사원명		급여
//	
//	3.커미션이 300이거나 500이거나 1400인 사원을 검색하시오
//	사원번호		사원명		급여
//	
//	4.사원 번호가 7521이거나 7844인 사원의 급여를 검색하시오
//	   EmpNo, Sal
//	   
//	5.소속이 삼성블루윙즈이면서 키가 170 이상인 선수들을 조회하시오
//	  선수명   팀번호   포지션      백넘버      키
	
	
	
	
	
	
	
	
	
	
	
	
	
}
