
public class FunctionTest2 {

//	1.사용자로부터 문자열 입력을 받았다
//	
//	사원테이블의 직급이 비밀번호라고 가정한다
//	직급을 사용자가 소문자로 manager이라고 입력했다면
//	틀린게 아니라 비밀번호가 맞다고 할려고 한다면 어떻게 sql문을 작성하여야
//	하는가?
//			
//	manager인 사원을 모두 조회하시오
//	
//	사원명	직급
//	
//	2.경기장의 지역번호와 전화번호를 합친 번호의 길이를 구하시오
//	STADIUM_ID		TEL				T_LEN
//	츨력예시
//	D03				063273-1763		11
//	B02				031753-3956		11
//	C06				054282-2002		11
//	,
//	,
//	,
//	F04				055				3
//	F05				031				3
	
//	1.SQL Expert라는 문자열이 있다
//	
//	Exp라는 문자열을 출력하시오
//	
//	 2.SQL Expert라는 문자열이 있다
//	   xpert를 대문자로 변경하여 출력하시오
//	   
//	   3.사원 테이블의 입사년도 컬럼에서
//	   년도와 달을 출력하시오
//	   
//	   입사년도      년도      달
//	            81      02
//	            80      12
//	            ,,,
//	   
//	   4.9월에 입사한 사원을 출력하시오
//	   사원명      입사년도
//	   
//	   5.선수 테이블에서 생년월일이 87년 생인 선수들을 조회하시오
//	   선수명   생년월일
//	   
//	   
//	   6.where ename like '%E';
//	   라는 sql문이 있다
//	   이를 substr을 활용하여 같은 기능을 구현하시오
//	   전체 컬럼
	
//	34.5678이라는 숫자를 반올림처리하여
//	30이라는 숫자가 나오도록 작성하시오
//	
//	35.5678
//	40
	
//	1.사원들의 연봉은 (SAL + 3000) * 12라고 친다
//	위와 같은 경우
//	각 사원들의 월급은 얼마이지 구하시오
//	연봉에서 월급을 구하는데 소수점 2번째 자리에서 반올림
//	연봉에서 월급을 구하는데 소수점 2번째 자리에서 내림처리한 결과
//	ENAME		SAL		연봉		월급(ROUND) 		월급(?????)
//	
//	2.선수들의 키가 짝수인 사람들만 출력하는데
//	키가 작은 순으로 정렬하시오
//	선수명		키
	
//	1.사원들의 경력(년차수)를 구하시오
	
	
	
}
