
public class GroupBy_HavingTest13 {

//	1.부서의 최대값과 최소값을 구하되 
//	   최대 급여가 2900 초과인 부서만 출력하시오
//	   부서번호가 빠른 순으로 
//	   
//	   부서번호      max      min
//	   
//	   
//	   2.선수테이블에서
//	   포지션별 최대키, 최소키, 평균키를 출력하시오
//	                  count(height)
//	   포지션      인원수   키대상       최대키   최소키   일반평균키      null적용평균키
//	   
//	   단, null값이 있는 경우 평균키(소수점없는 값 내림처리)를 적용한다
//	   
//	   3.평균키가 180이상인 
//	   포지션별 평균키를 반올림으로 소수점 3번째 자리에서 적용한 값을 구하시오
//	   포지션      평균키
//	   
//	   4.선수들 중 삼성블루윙즈와 fc서울의 인원수는 얼마인가?
//	   팀ID      인원수      
//	         
//	   5.포지션별 평균키만 출력하는데
//	   최대키가 190 이상인 선수를 가지고 있는 포지션의 정보만 출력하시오
//	   포지션   평균키
}
