
public class JOINTTest15 {

//	1. 선수들의 팀명을 출력하시오
//	   팀명을 기준으로 빠른순으로 정렬
//	   
//	   선수번호      선수명   팀ID      팀명
//	   
//	   
//	   2.조인을 사용하여 뉴욕에서 근무하는 사원의 이름과 급여를 출력하시오
//	   급여가 큰 사람 순으로 정렬
//	   사원번호   사원명   급여      부서번호   부서명   근무지
//	   
//	   3.ACCOUNTING 부서 소속 사원의 이름과 입사일을 출력하시오
//	   사원명   부서명      입사일
//	                  1989-02-01 같은 느낌
//	                  
//	                  
//	   4.직급이 MANAGER인 사원의 이름, 부서명을 출력하시오
//	   사원번호      사원명   직급      부서번호      부서명
	
//	   1.포지션이 골키퍼(GK)인 선수들에 대한 데이터만을 백넘버 순으로 출력하시오
//	   선수명   백넘버   연고지(REGION_NAME)      팀명
//	   
//	   
//	   2.팀 테이블과 구장 테이블의 관계를 이용해서 구하시오
//	   소속팀이 가지고 있는 전용구장의 정보를 팀의 정보와 함게 출력하시오
//	   연고지가 빠른 순으로 정렬
//	   		연고지   	팀명			STADIUM_ID		STADIUM_NAME	좌석수
//	EX:		전북		현대모터스		D03				전주월드컵경기장		28,000                              
//			경남     												27,085
	
//	1.'SMITH의 상사는 ???입니다' 라고 출력되도록 하시오
//	   정렬은 사원이름순으로 한다
//	   컬럼명은 사원과 상사의 정보
//	   
//	   사원명      상사명      사원과 상사의 정보
//	   
//	   2.매니저가 KING인 사원들의 이름과 직급을 출력하시오
//	   WORK_NAME   WORK_JOB   상사명
//	   
//	   3.SMITH와 동일한 근무지에서 근무하는 사원의 이름을 출력하시오
//	   SMITH사원명   동료사원명    
	
//	1.상사와 사원이 존재한다
//	   상사가 있는 사원들과 상사가 존재하지 않는 사원들의 정보를 모두 출력하시오
//	   일반사원      직장상사                  직장상사의 번호
//	   SMITH      JONES                  1234
//	   ???         NULL 은 상사없음으로 출력하시오   NULL 0
//	         
//	   2.경기장에 등록된 운동장 중에 홈팀이 없는 경기장도 출력하시오
//	   홈팀ID로 오름차순하시오
//	   경기장명   경기장ID      좌석수   HOMETEAM_ID      팀명
	
//	1.포지션이 GK가 아닌 선수들
//	   그리고 팀이 삼성블루윙즈인 선수들에 대해 출력하시오
//	   선수명이 느린 순으로 출력
//	   
//	   선수번호      선수명   백넘버   포지션   팀명
//	   
//	   2.소속팀이 가지고 있는 전용구장 중 좌석수가 50000 이상인 전용구장만 출력하시오
//	   좌석수가 큰 순으로 출력
//	   
//	   팀번호   팀명      경기장번호      경기장명   좌석수   
//	   
//	   3.사원들의 급여 중 1~2등급인 사원들의 정보를 출력하시오
//	   급여가 낮은 사원부터 출력되도록 하시오
//	   사원번호   사원명   직급      급여      급여등급   낮은값   큰값

//	4.홈팀이 3점 이상 차이로 승리한 경기의 경기장 이름, 경기 일정,
//	   홈팀 이름과 원정팀 이름 정보를 출력하시오
//	   경기장ID   경기장명   경기날짜   팀명      상태팀명   HOME_SCORE   AWAY_SCORE
	
	
	
}
