
public class SubQueryTest17 {

//	1.SMITH와 같은 부서에서 근무하는 사원의 이름과 부서의 번호를 출력하시오
//	   사원번호      사원명      DEPTNO
//	   
//	   
//	   2.FORD와 동일한 직급을 가진 사원을 출력하시오
//	   전체 컬럼
//	   
//	   
//	   3.FORD의 급여와 동일하거나 더 많이 받는 사원명의 급여를 출력하시오
//	   사원번호      급여
//	   
//	   4.정남일 선수가 소속된 팀의 선수들에 대한 정보를 표시하시오
//	   조인문과 서브쿼리 둘 다 구하기
//	   팀ID가 빠른순으로 정렬하시오
//	   팀ID      팀명       선수컬럼전부         
//	   
//	   5.선수들 중에서 키가 평균 이하인 선수들의 정보를 조회하시오
//	   선수명   포지션   키      백넘버
//	   
//	   1.SMITH와 같은 부서에서 근무하는 사원의 이름과 부서의 번호를 출력하시오
//	   사원번호      사원명      DEPTNO
//	   
//	   
//	   2.FORD와 동일한 직급을 가진 사원을 출력하시오
//	   전체 컬럼
//	   
//	   
//	   3.FORD의 급여와 동일하거나 더 많이 받는 사원명의 급여를 출력하시오
//	   사원번호      급여
//	   
//	   4.정남일 선수가 소속된 팀의 선수들에 대한 정보를 표시하시오
//	   조인문과 서브쿼리 둘 다 구하기
//	   팀ID가 빠른순으로 정렬하시오
//	   팀ID      팀명       선수컬럼전부         
//	   
//	   5.선수들 중에서 키가 평균 이하인 선수들의 정보를 조회하시오
//	   선수명   포지션   키      백넘버
	
//	1.부서별로 가장 급여를 많이 받는 사원의 정보를 출력하시오
//	   EMPNO   ENAME   SAL      DEPTNO
//	   
//	   
//	   2.직급이 SALESMAN 인 사원이 받는 급여들의 최소 급여보다
//	   많이 받는 사원들의 이름과 급여를 출력하되 
//	   부서번호가 20번인 사원은 제외하시오
//	   사원번호      사원명      직급      급여      부서번호
	
	
//	1.직급이 MANAGER인 사람이 속한 부서의 부서 번호와 부서명과 지역을 출력하시오
//	   부서번호   부서명   LOCATION
//	   
//	   2.SMITH와 동일한 직급을 가진 사원의 이름과 직급을 출력하라
//	   사원번호   사원명   급여      직급
//	   
//	   3.직급이 매니저인 사원이 받는 급여들의 최대 급여보다 많이 받는 사원들의
//	   이름과 급여를 출력하되 부서번호가 20번인 사원은 제외하시오
//	   
//	   4.선수들 중 정현수라는 선수가 소속되어 있는 팀 정보를 출력하시오
//	   연고지명   팀명      영문팀명
//	   
//	   
//	   5.영업 사원들의 최소 급여보다 많이 받는 사원들의 이름과 급여,
//	   직급을 출력하되 영업 사원은 출력하지 마시오
//	   사원번호   사원명   담당업무   급여
	
//	1.k-리그 선수들 중에서 포지션이 미드필더인 선수들의 
//	   소속팀명 및 선수 정보를 출력하시오
//	   인라인 뷰를 꼭 사용하시오
//	//   선수 테이블들에 관련된 정보만 인라인 뷰 시키시오
//	   
//	   팀ID           팀명      선수번호   선수명      백넘버
}
